---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.op_Inequality(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
source: html/db31d0e1-7a56-51a1-07f8-1c64a6013b8a.htm
---
# Autodesk.Revit.DB.ForgeTypeId.op_Inequality Method

## Syntax (C#)
```csharp
public static bool operator !=(
	ForgeTypeId lhs,
	ForgeTypeId rhs
)
```

## Parameters
- **lhs** (`Autodesk.Revit.DB.ForgeTypeId`)
- **rhs** (`Autodesk.Revit.DB.ForgeTypeId`)